case3/TemplateCase0.05/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.488498 -0.245119 0.005)
(-0.46856 -0.245119 0.005)
(-0.448621 -0.245119 0.005)
(-0.428682 -0.245119 0.005)
(-0.408743 -0.245119 0.005)
(-0.388805 -0.245119 0.005)
(-0.368866 -0.245119 0.005)
(-0.348927 -0.245119 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.498466 -0.245114 0.005)
(-0.495403 -0.23534 0.005)
(-0.492356 -0.225562 0.005)
(-0.489336 -0.215775 0.005)
(-0.486352 -0.205977 0.005)
(-0.483416 -0.196165 0.005)
(-0.480538 -0.186335 0.005)
(-0.477728 -0.176486 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.498466 -0.245114 0.005)
(0.495403 -0.23534 0.005)
(0.492356 -0.225562 0.005)
(0.489336 -0.215775 0.005)
(0.486352 -0.205977 0.005)
(0.483416 -0.196165 0.005)
(0.480538 -0.186335 0.005)
(0.477728 -0.176486 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
